# =============================================================================
# Brewfile - Homebrew Bundle
# =============================================================================
# Uso: brew bundle install --file=Brewfile
# Para generar desde tu sistema actual: brew bundle dump
# =============================================================================

# Taps adicionales
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"

# =============================================================================
# CLI Tools
# =============================================================================

# Esenciales
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "jq"
brew "htop"
brew "tldr"

# Herramientas modernas (replacements)
brew "ripgrep"      # grep mejorado (rg)
brew "fd"           # find mejorado
brew "bat"          # cat mejorado
brew "eza"          # ls mejorado (antes exa)
brew "fzf"          # fuzzy finder
brew "zoxide"       # cd mejorado (z)
brew "delta"        # diff mejorado para git
brew "procs"        # ps mejorado
brew "dust"         # du mejorado
brew "duf"          # df mejorado

# Desarrollo
brew "gh"           # GitHub CLI
brew "lazygit"      # Git TUI
brew "tmux"         # Terminal multiplexer
brew "httpie"       # HTTP client amigable
brew "shellcheck"   # Linter para shell scripts
brew "direnv"       # Variables de entorno por directorio
brew "gnupg"        # GPG para firmar commits
brew "yq"           # jq para YAML

# Databases
brew "postgresql@16"
brew "redis"

# Cloud & Infrastructure
brew "awscli"
brew "kubectl"
brew "stripe/stripe-cli/stripe"
brew "railway"

# Testing & Performance
brew "k6"              # Load testing

# Utilidades
brew "mas"          # Mac App Store CLI
brew "trash"        # Mover a papelera en vez de rm
brew "watch"        # Ejecutar comando periodicamente

# Runtimes adicionales
brew "oven-sh/bun/bun"  # Bun runtime

# =============================================================================
# Lenguajes y Runtimes
# =============================================================================

# Python
brew "python"
brew "pipx"

# Go (descomentar si necesitas)
# brew "go"

# Rust (descomentar si necesitas)
# brew "rustup-init"

# =============================================================================
# Aplicaciones (Cask)
# =============================================================================

# Navegadores
cask "google-chrome"
cask "firefox"

# Desarrollo
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
cask "docker"
cask "postman"
cask "tableplus"

# Productividad
cask "rectangle"
cask "raycast"

# Comunicación
cask "slack"
cask "discord"

# Networking
cask "tailscale"        # VPN mesh para acceso remoto

# Utilidades
cask "the-unarchiver"
cask "appcleaner"

# Entretenimiento
cask "spotify"

# Mobile Development
cask "android-studio"
# cask "flutter"        # Descomentar si usas Flutter
# cask "react-native-debugger"

# Cloud
cask "google-cloud-sdk"

# Design & Productivity
cask "figma"
cask "notion"

# Fuentes para terminal
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# =============================================================================
# Mac App Store (requiere mas y estar logueado)
# =============================================================================

# Descomenta y agrega el ID de las apps que quieras
# mas "Xcode", id: 497799835
# mas "Magnet", id: 441258766
# mas "Bear", id: 1091189122
