aaron-bond.better-comments
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
enkia.tokyo-night
esbenp.prettier-vscode
expo.vscode-expo-tools
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
gruntfuggly.todo-tree
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
msjsdiag.vscode-react-native
mtxr.sqltools
naumovs.color-highlight
pkief.material-icon-theme
pranaygp.vscode-css-peek
rangav.vscode-thunder-client
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wix.vscode-import-cost
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
